
Процедура КнопкаСформироватьНажатие(Кнопка)
	ЭлементыФормы.ПолеТабличногоДокумента1.Очистить();
	Макет = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	ОбластьМакета.Параметры["НачПериода"] = Формат(НачПериода, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры["КонПериода"] = Формат(КонПериода,"ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры["Организация"] = Организация;
	ОбластьМакета.Параметры["Контрагент"] = Контрагент;
	
	ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета);
	Запрос = Новый Запрос;
	
	Запрос = Новый Запрос;
	если не Услуги и Товары тогда
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка,
				   |	РеализацияТоваровУслугТовары.Ссылка.Номер,
				   |	РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |    РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.КоличествоФакт КАК Количество,
	               |	РеализацияТоваровУслугТовары.СуммаФакт КАК Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
				   Если ЗначениеЗаполнено(Организация) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация";
					   Запрос.УстановитьПараметр("Организация", Организация);
				   КонецЕсли;
				   Если ЗначениеЗаполнено(Контрагент) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Контрагент = &Контрагент";
					   Запрос.УстановитьПараметр("Контрагент", Контрагент);
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
				   |РеализацияТоваровУслугТовары.Ссылка.Дата
    			   |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(Сумма)
	               |ПО
	               |	ОБЩИЕ,
	               |	Номенклатура";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(КонПериода));
	
	ЭлементыФормы.ПолеТабличногоДокумента1.НачатьАвтогруппировкуСтрок();	
	сч = 1;
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(Результат);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Результат.Уровень());
		Статьи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Статьи.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка2");
			ОбластьМакета.Параметры.Заполнить(Статьи);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Статьи.Уровень());
			ДетальныеЗаписи = Статьи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ДетальныеЗаписи.Следующий() Цикл 
				ОбластьМакетаС = Макет.ПолучитьОбласть("Строка3");
				ОбластьМакетаС.Параметры.Заполнить(ДетальныеЗаписи);
				ОбластьМакетаС.Параметры.сч = сч;
				ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакетаС,ДетальныеЗаписи.Уровень());
				сч=сч+1;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	конецесли;
	если Услуги и не Товары тогда
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка,
				   |	РеализацияТоваровУслугТовары.Ссылка.Номер,
				   |	РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |    РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
				   Если ЗначениеЗаполнено(Организация) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация";
					   Запрос.УстановитьПараметр("Организация", Организация);
				   КонецЕсли;
				   Если ЗначениеЗаполнено(Контрагент) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Контрагент = &Контрагент";
					   Запрос.УстановитьПараметр("Контрагент", Контрагент);
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
				   |РеализацияТоваровУслугТовары.Ссылка.Дата
    			   |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(Сумма)
	               |ПО
	               |	ОБЩИЕ,
	               |	Номенклатура";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(КонПериода));
	
	ЭлементыФормы.ПолеТабличногоДокумента1.НачатьАвтогруппировкуСтрок();	
	сч = 1;
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(Результат);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Результат.Уровень());
		Статьи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Статьи.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка2");
			ОбластьМакета.Параметры.Заполнить(Статьи);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Статьи.Уровень());
			ДетальныеЗаписи = Статьи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ДетальныеЗаписи.Следующий() Цикл 
				ОбластьМакетаС = Макет.ПолучитьОбласть("Строка3");
				ОбластьМакетаС.Параметры.Заполнить(ДетальныеЗаписи);
				ОбластьМакетаС.Параметры.сч = сч;
				ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакетаС,ДетальныеЗаписи.Уровень());
				сч=сч+1;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	конецесли;
	если Услуги и Товары тогда
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.Номер,
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.КоличествоФакт КАК Количество,
	               |	РеализацияТоваровУслугТовары.СуммаФакт КАК Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
				   
				   Если ЗначениеЗаполнено(Организация) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация";
					   Запрос.УстановитьПараметр("Организация", Организация);
				   КонецЕсли;
				   
				   Если ЗначениеЗаполнено(Контрагент) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугТовары.Ссылка.Контрагент = &Контрагент";
					   Запрос.УстановитьПараметр("Контрагент", Контрагент);
				   КонецЕсли;

				   Запрос.Текст = Запрос.Текст +"
				   |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.Номер,
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |	РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |	РеализацияТоваровУслугУслуги.Номенклатура,
	               |	РеализацияТоваровУслугУслуги.Количество,
	               |	РеализацияТоваровУслугУслуги.Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
				   Если ЗначениеЗаполнено(Организация) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация";
					   Запрос.УстановитьПараметр("Организация", Организация);
				   КонецЕсли;
				   Если ЗначениеЗаполнено(Контрагент) Тогда 
					   Запрос.Текст = Запрос.Текст+ " 
					   |И РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент";
					   Запрос.УстановитьПараметр("Контрагент", Контрагент);
				   КонецЕсли;
				   
				   Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
				   |РеализацияТоваровУслугТовары.Ссылка.Дата
    			   |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(Сумма)
	               |ПО
	               |	ОБЩИЕ,
	               |	Номенклатура";
				   
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(КонПериода));
	
	ЭлементыФормы.ПолеТабличногоДокумента1.НачатьАвтогруппировкуСтрок();	
	сч = 1;
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(Результат);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Результат.Уровень());
		Статьи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Статьи.Следующий() Цикл 
			ОбластьМакета = Макет.ПолучитьОбласть("Строка2");
			ОбластьМакета.Параметры.Заполнить(Статьи);
			ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакета,Статьи.Уровень());
			ДетальныеЗаписи = Статьи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ДетальныеЗаписи.Следующий() Цикл 
				ОбластьМакетаС = Макет.ПолучитьОбласть("Строка3");
				ОбластьМакетаС.Параметры.Заполнить(ДетальныеЗаписи);
				ОбластьМакетаС.Параметры.сч = сч;
				ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(ОбластьМакетаС,ДетальныеЗаписи.Уровень());
				сч=сч+1;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	конецесли;
	ЭлементыФормы.ПолеТабличногоДокумента1.ЗакончитьАвтогруппировкуСтрок();
	ЭлементыФормы.ПолеТабличногоДокумента1.ПоказатьУровеньГруппировокСтрок(0);
	ЭлементыФормы.ПолеТабличногоДокумента1.ТолькоПросмотр = Истина;
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

