
Процедура КнопкаВыполнитьНажатие(Кнопка)
	СчФВыборка = Документы.СчетФактураВыданный.Выбрать(НачПериода ,КонецДня(КонПериода), Новый Структура("Организация", Организация));
	Пока СчФВыборка.Следующий() Цикл
		Док = СчФВыборка.Ссылка.ПолучитьОбъект();
		СтарыйНомер = Док.Номер;
		Если Лев(СтарыйНомер,2) = "АВ" Тогда 
			НовыйНомер = Строка(Число(Сред(СтарыйНомер,3)));
			НовыйНомер = СтрЗаменить(НовыйНомер,Символы.НПП,"");
			Пока СтрДлина(НовыйНомер) <> 6 Цикл 
				НовыйНомер = "0"+НовыйНомер;
				НовыйНомер = СтрЗаменить(НовыйНомер,Символы.НПП,"");
			КонецЦикла;
			НовыйНомер = "АВ"+НовыйНомер;
		Иначе 
			НовыйНомер = Строка(Число(СтарыйНомер));      
			НовыйНомер = СтрЗаменить(НовыйНомер,Символы.НПП,"");
			Пока СтрДлина(НовыйНомер) <> 8 Цикл 
				НовыйНомер = "0"+НовыйНомер;
				НовыйНомер = СтрЗаменить(НовыйНомер,Символы.НПП,"");
			КонецЦикла;
		КонецЕсли;
		Док.Номер = НовыйНомер;
		Док.Записать();
	КонецЦикла;
	
		

КонецПроцедуры
