
&НаСервере
Процедура Команда1НаСервере()
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераIMAP = Константы.АдресСервераIMAP.Получить();
	Профиль.ПортIMAP = Константы.ПортIMAP.Получить();
	Профиль.ПользовательIMAP = Константы.ПользовательIMAP.Получить();
	Профиль.ПарольIMAP = Константы.ПарольIMAP.Получить();
	Профиль.ВремяОжидания = 50; 
	
	Почта = Новый ИнтернетПочта;
	
	Попытка
		Почта.Подключиться(Профиль,ПротоколИнтернетПочты.IMAP);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;
	
	ОтборПисем = Новый Структура;
	ОтборПисем.Вставить("Seen", Ложь);
	
	Заголовки=Почта.ПолучитьЗаголовки(ОтборПисем);
	Если Заголовки.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В почтовом ящике совсем нет входящих сообщений!");
	КонецЕсли;
	
	ПутьКФайлу = Константы.ПутьКФайлуЗагрузкиПродажДистрибьютору.Получить();
	
	// Загрузка сообщений в массив
	Сообщения = Почта.Выбрать(Ложь,Заголовки,Истина);	
	Для Каждого Сообщение Из Сообщения Цикл	
		Для каждого Вложение Из Сообщение.Вложения Цикл
			Вложение.Данные.Записать(ПутьКФайлу+"\"+Вложение.Name);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры