
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьМакетаШапка            = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока           = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаПодвал           = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаШапка.Параметры.НачДата = НачДата;
	ОбластьМакетаШапка.Параметры.КонДата = КонДата;
	//ОбластьМакетаШапка.Параметры.Организация = Организация;
	ОбластьМакетаШапка.Параметры.Контрагент = Контрагент;
	ОбластьМакетаШапка.Параметры.ТипНоменклатуры = ТипНоменклатуры;
	
	// ищем отгрузки		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК ПродалиКоличество,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК ПродалиСумма,
	|	СУММА(РеализацияТоваровУслугТовары.КоличествоФакт) КАК КупилиКоличество,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаФакт) КАК КупилиСумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ПОМЕСТИТЬ КупилиПродали
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПроверкеДокументов КАК СведенияОПроверкеДокументов
	|		ПО РеализацияТоваровУслугТовары.Ссылка = СведенияОПроверкеДокументов.Документ
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	|	И РеализацияТоваровУслугТовары.Ссылка.ВнутреннийНомерНакладной > 0
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|И РеализацияТоваровУслугТовары.Ссылка.Контрагент = &Контрагент";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|И РеализацияТоваровУслугТовары.ТипНоменклатуры = &ТипНоменклатуры";
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура";
	КонецЕсли;
	
	Если ВыводитьТолькоПроверенные Тогда 
		Запрос.Текст = Запрос.Текст + "
		|И ЕСТЬNULL(СведенияОПроверкеДокументов.Проверен, ЛОЖЬ) = ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка.Организация,
	|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ),
	|	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслугУслуги.Дата, ДЕНЬ) КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьДоставку
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Содержание КАК СТРОКА(100)) ПОДОБНО &Корректировка
	|							ТОГДА ПоступлениеТоваровУслугУслуги.Количество
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьДоставку
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Содержание КАК СТРОКА(100)) ПОДОБНО &Корректировка
	|							ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоставкаСумма,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьДоставку
	|				ТОГДА ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(ПоступлениеТоваровУслугУслуги.Содержание КАК СТРОКА(100)) ПОДОБНО &Корректировка
	|							ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПростойСумма,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьДоставку
	|				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяСуммаДоставки,
	|	ПоступлениеТоваровУслугУслуги.Контрагент,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация,
	|	&ТипНоменклатуры
	|ПОМЕСТИТЬ Доставка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПроверкеДокументов КАК СведенияОПроверкеДокументов
	|		ПО ПоступлениеТоваровУслугУслуги.Ссылка = СведенияОПроверкеДокументов.Документ
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваровУслугУслуги.Дата МЕЖДУ &НачДата И &КонДата
	|	И ПоступлениеТоваровУслугУслуги.Ссылка.Организация = &Организация";
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И ПоступлениеТоваровУслугУслуги.Контрагент = &Контрагент";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура = &УслугиДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслугУслуги.Дата, ДЕНЬ),
	|	ПоступлениеТоваровУслугУслуги.Контрагент,
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КупилиПродали.Дата,
	|	КупилиПродали.Организация,
	|	КупилиПродали.Контрагент,
	|	КупилиПродали.ПродалиКоличество,
	|	КупилиПродали.ПродалиСумма,
	|	КупилиПродали.КупилиКоличество,
	|	КупилиПродали.КупилиСумма,
	|	0 КАК КоличествоДоставка,
	|	0 КАК ДоставкаСумма,
	|	0 КАК ПростойСумма,
	|	0 КАК ОбщаяСуммаДоставки
	|ПОМЕСТИТЬ КупилиПродалиДоставили
	|ИЗ
	|	КупилиПродали КАК КупилиПродали
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доставка.Дата,
	|	Доставка.Организация,
	|	Доставка.Контрагент,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Доставка.Количество,
	|	Доставка.ДоставкаСумма,
	|	Доставка.ПростойСумма,
	|	Доставка.ОбщаяСуммаДоставки
	|ИЗ
	|	Доставка КАК Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КупилиПродалиДоставили.Дата,
	|	КупилиПродалиДоставили.Организация,
	|	КупилиПродалиДоставили.Контрагент,
	|	СУММА(КупилиПродалиДоставили.ПродалиКоличество) КАК ПродалиКоличество,
	|	СУММА(КупилиПродалиДоставили.ПродалиСумма) КАК ПродалиСумма,
	|	СУММА(КупилиПродалиДоставили.КупилиКоличество) КАК КупилиКоличество,
	|	СУММА(КупилиПродалиДоставили.КупилиСумма) КАК КупилиСумма,
	|	СУММА(КупилиПродалиДоставили.КоличествоДоставка) КАК КоличествоДоставка,
	|	СУММА(КупилиПродалиДоставили.ДоставкаСумма) КАК ДоставкаСумма,
	|	СУММА(КупилиПродалиДоставили.ПростойСумма) КАК ПростойСумма,
	|	СУММА(КупилиПродалиДоставили.ОбщаяСуммаДоставки) КАК ОбщаяСуммаДоставки
	|ПОМЕСТИТЬ ДляВычисленияЦен
	|ИЗ
	|	КупилиПродалиДоставили КАК КупилиПродалиДоставили
	|
	|СГРУППИРОВАТЬ ПО
	|	КупилиПродалиДоставили.Контрагент,
	|	КупилиПродалиДоставили.Организация,
	|	КупилиПродалиДоставили.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ДляВычисленияЦен.Дата,
	|ДляВычисленияЦен.Организация,
	|ДляВычисленияЦен.Контрагент,
	|ДляВычисленияЦен.ПродалиКоличество,
	|ВЫБОР
	|	КОГДА ДляВычисленияЦен.ПродалиКоличество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ДляВычисленияЦен.ПродалиСумма / ДляВычисленияЦен.ПродалиКоличество
	|	КОНЕЦ КАК Цена,
	|	ДляВычисленияЦен.ПродалиСумма,
	|	ДляВычисленияЦен.КупилиКоличество,
	|	ДляВычисленияЦен.КупилиСумма,
	|	ДляВычисленияЦен.КоличествоДоставка,
	|	ВЫБОР
	|		КОГДА ДляВычисленияЦен.КоличествоДоставка = 0
	|			ТОГДА 0
	|		ИНАЧЕ ДляВычисленияЦен.ДоставкаСумма / ДляВычисленияЦен.КоличествоДоставка
	|	КОНЕЦ КАК ЦенаДоставка,
	|	ДляВычисленияЦен.ДоставкаСумма,
	|	ДляВычисленияЦен.ПростойСумма,
	|	ДляВычисленияЦен.ОбщаяСуммаДоставки,
	| ДляВычисленияЦен.ПродалиСумма-ДляВычисленияЦен.КупилиСумма-ДляВычисленияЦен.ОбщаяСуммаДоставки как Прибыль
	|ИЗ
	|	ДляВычисленияЦен КАК ДляВычисленияЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДляВычисленияЦен.Дата
	|ИТОГИ
	|СУММА(ПродалиКоличество),
	|СУММА(ПродалиСумма),
	|СУММА(КупилиКоличество),
	|СУММА(КупилиСумма),
	|СУММА(КоличествоДоставка),
	|СУММА(ДоставкаСумма),
	|СУММА(ПростойСумма),
	|СУММА(ОбщаяСуммаДоставки),
	|СУММА(Прибыль)
	|ПО
	|ОБЩИЕ";
	
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонДата));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("УслугиДоставки", Справочники.Номенклатура.НайтиПоНаименованию("Услуги автотранспорта по доставке асфальта"));
	Запрос.УстановитьПараметр("Корректировка", "%Корректировка%");
	Запрос.УстановитьПараметр("ВыводитьДоставку", ВыводитьДоставку);
	
	
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		ОбластьМакетаСтрока.Параметры.Заполнить(Результат);
		Премия = 0; 
		ОбластьМакетаСтрока.Параметры.Премия = Премия;
		//ОбластьМакетаСтрока.Параметры.Прибыль = Результат.ПродалиСумма-Результат.КупилиСумма-Результат.ОбщаяСуммаДоставки - Премия;
		
		ТабДокумент.Вывести(ОбластьМакетаСтрока);
	КонецЦикла;
	
	
	ТабДокумент.ТолькоПросмотр = Истина;	
	ТабДокумент.Показать("Общий отчет");
	
КонецПроцедуры

Процедура ПриОткрытии()
КонецПроцедуры
