
Процедура КнопкаСформироватьНажатие(Кнопка)
	Выручка = 0;
	Сырье = 0;
	ПроизводственныеРасходы = 0;
	НеПроизводственныеРасходы = 0;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьМакетаШапка            = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока           = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтог             = Макет.ПолучитьОбласть("СтрокаИтог");
	
	ОбластьМакетаШапка.Параметры.НачДата = Формат(НачДата,"ДФ=dd.MM.yyyy" );
	ОбластьМакетаШапка.Параметры.КонДата = Формат(КонДата,"ДФ=dd.MM.yyyy" );
	
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	АБЗИСТОК = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	|	И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата1
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Цена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	""Прочие доходы""
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Период, Счет = &Счет, , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|ИТОГИ ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата1", КонецДня(КонДата));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.01"));
	
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		Выручка = РЕзультат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Выручка от продаж, всего";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК Сумма,
	|	ХозрасчетныйОбороты.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОбороты.КоличествоОборотКт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("10"));
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		Сырье = Результат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Сырье";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК Сумма,
	|	ХозрасчетныйОбороты.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОбороты.КоличествоОборотКт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("26"));
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		ПроизводственныеРасходы = Результат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Производственные расходы";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК Сумма,
	|	ХозрасчетныйОбороты.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОбороты.КоличествоОборотДт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.02"));
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		НеПроизводственныеРасходы = Результат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Непроизводственные расходы";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	Прибыль = Выручка - Сырье - ПроизводственныеРасходы - НеПроизводственныеРасходы;
	ОбластьМакетаИтог.Параметры.НаименованиеИтога = "ПРИБЫЛЬ";
	ОбластьМакетаИтог.Параметры.Сумма = Прибыль;
	ТабДокумент.Вывести(ОбластьМакетаИтог,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК Сумма,
	|	ХозрасчетныйОстатки.КоличествоОстатокДт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&кондата, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("10"));
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		//Сырье = Результат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Остатки сырья и материалов";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	Запрос = Новый Запрос; //справочно
	Запрос.Текст = "ВЫБРАТЬ
	|	""Заработная плата"" КАК Номенклатура,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма,
	|	ХозрасчетныйОстатки.КоличествоОстатокКт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&кондата, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Налоги с ФОТ"",
	|	ХозрасчетныйОстатки.СуммаОстатокКт,
	|	ХозрасчетныйОстатки.КоличествоОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&кондата, Счет В ИЕРАРХИИ (&СчетаНалог), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	//Запрос.УстановитьПараметр("КонДата", НачалоДня(КонецДня(КонДата)+1));
	Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("70"));
	
	Массив = Новый Массив;
	Массив.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("68"));
	Массив.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("69"));
	
	Запрос.УстановитьПараметр("СчетаНалог", Массив);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		//Сырье = Результат.Сумма;
		ОбластьМакетаИтог.Параметры.Заполнить(Результат);
		ОбластьМакетаИтог.Параметры.НаименованиеИтога = "Задолженность (справочно)";
		ТабДокумент.Вывести(ОбластьМакетаИтог, Результат.Уровень());
		ДетальныеЗаписи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(ДетальныеЗаписи);
			ТабДокумент.Вывести(ОбластьМакетаСтрока, ДетальныеЗаписи.Уровень());
		КонецЦикла;	
	КонецЦикла;
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(1);
	ТабДокумент.ТолькоПросмотр = Истина;	
	Если ВыводитьФинансовыйОтчет Тогда 
		ТабДокумент.Показать("Фин.отчет");
		ТабДокумент.ФиксацияСверху = ТабДокумент.Области.Шапка.Низ;
	КонецЕсли;
	
	Если ВыводитьРасчетыСУчредителями Тогда 
		Резерв = 1500000;
		ПрибыльКРаспределению = Прибыль - Резерв;

		ТабДокумент3 = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("Макет1");
		
		//Получим резерв
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачДата, Счет = &Счет, , Субконто1.Наименование = ""Резерв"") КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.Организация = &Организация";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("75.02"));
	Запрос.УстановитьПараметр("Организация", АБЗИСТОК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Резерв = Строка(Резерв+ВыборкаДетальныеЗаписи.СуммаОстатокКт)+" (на начало периода "+Строка(ВыборкаДетальныеЗаписи.СуммаОстатокКт)+")"; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
		
		ОбластьМакетаШапка            = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогОбщий        = Макет.ПолучитьОбласть("ИтогОбщий");
		
		ОбластьМакетаШапка.Параметры.НачДата = Формат(НачДата,"ДФ=dd.MM.yyyy" );
		ОбластьМакетаШапка.Параметры.КонДата = Формат(КонДата,"ДФ=dd.MM.yyyy" );
		ОбластьМакетаШапка.Параметры.Прибыль = Прибыль;
		ОбластьМакетаШапка.Параметры.Резерв = Резерв;
		ОбластьМакетаШапка.Параметры.ПрибыльКРаспределению = ПрибыльКРаспределению;

		ТабДокумент3.Вывести(ОбластьМакетаШапка);
		
		ИтПроцент = 0;
		ИтЗадолженность = 0;
		ИтОплачено = 0;
		ИтЗадолженностьКонец = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК Задолженность,
		               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК Оплачено,
		               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК ЗадолженностьКонец,
		               |	ХозрасчетныйОстаткиИОбороты.Субконто1.Наименование КАК Сотрудник
		               |ПОМЕСТИТЬ Остатки
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачДата, &КонДата, , , Счет = &Счет, , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СотрудникиОрганизаций.Ссылка,
		               |	СотрудникиОрганизаций.ПремияПолучаемаяОтПрибыли,
		               |	ЕСТЬNULL(Остатки.Задолженность, 0) КАК Задолженность,
		               |	ЕСТЬNULL(Остатки.Оплачено, 0) КАК Оплачено,
		               |	ЕСТЬNULL(Остатки.ЗадолженностьКонец, 0) КАК ЗадолженностьКонец
		               |ИЗ
		               |	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		               |		ПО СотрудникиОрганизаций.Наименование = Остатки.Сотрудник
		               |ГДЕ
		               |	СотрудникиОрганизаций.Организация = &Организация
		               |	И СотрудникиОрганизаций.ПремияПолучаемаяОтПрибыли > 0";
		
		Запрос.УстановитьПараметр("НачДата", НачДата);
		Запрос.УстановитьПараметр("КонДата", Новый Граница(КонецДня(КонДата),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("75.02"));
		Запрос.УстановитьПараметр("Организация", АБЗИСТОК);

		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл 
			ОбластьМакетаСтрока.Параметры.Заполнить(Результат);
			Сотрудник = Результат.Ссылка;
			Процент = Результат.ПремияПолучаемаяОтПрибыли;
			ОбластьМакетаСтрока.Параметры.Сотрудник = Сотрудник;
			ОбластьМакетаСтрока.Параметры.Процент = Процент;
			ОбластьМакетаСтрока.Параметры.Премия = Процент*ПрибыльКРаспределению/100;
			ТабДокумент3.Вывести(ОбластьМакетаСтрока);
			ИтПроцент = ИтПроцент + Процент;
			ИтЗадолженность = ИтЗадолженность+Результат.Задолженность;
			ИтОплачено = ИтОплачено+Результат.Оплачено;
			ИтЗадолженностьКонец = ИтЗадолженностьКонец + Результат.ЗадолженностьКонец;
		КонецЦикла;
			
		//ОбластьМакетаИтогОбщий.Параметры.ИтПроцент = ИтПроцент;
		ОбластьМакетаИтогОбщий.Параметры.ИтПремия = ИтПроцент*ПрибыльКРаспределению/100;
		ОбластьМакетаИтогОбщий.Параметры.ИтЗадолженность = ИтЗадолженность;
		ОбластьМакетаИтогОбщий.Параметры.ИтОплачено = ИтОплачено;
		ОбластьМакетаИтогОбщий.Параметры.ИтЗадолженностьКонец = ИтЗадолженностьКонец;
		ТабДокумент3.Вывести(ОбластьМакетаИтогОбщий);
		ТабДокумент3.ТолькоПросмотр = Истина;	
		ТабДокумент3.Показать("Расчеты с учредителями");
		ТабДокумент3.ФиксацияСверху = ТабДокумент3.Области.Шапка.Низ;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачДата, ?(КонДата='0001-01-01', КонДата, КонецДня(КонДата)));
	Если НастройкаПериода.Редактировать() Тогда
		НачДата = НастройкаПериода.ПолучитьДатуНачала();
		КонДата = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры
