
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпецификацииНоменклатуры.Ссылка КАК Спецификация,
	               |	РеализацияТоваровУслугТовары.КоличествоФакт КАК Нетто,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	               |		ПО РеализацияТоваровУслугТовары.Номенклатура.Ссылка = СпецификацииНоменклатуры.Владелец
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.ВнутреннийНомерНакладной > 0
	               |	И РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("НачДата", НачалоДня(НачДата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(НачДата));
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		
		Док = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		Если НачалоДня(Результат.Ссылка.Дата - 1) = НачалоДня(Результат.Ссылка.Дата) Тогда 
			ДатаДок =  Результат.Ссылка.Дата - 1;
		Иначе 
			ДатаДок = НачалоДня(Результат.Ссылка.Дата)
		КонецЕсли; 
		
		Док.Дата = ДатаДок;
			
		Док.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
		Док.Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
		Док.ИспользоватьМатериалы = Истина;
		док.СчетЗатрат = ПланыСчетов.Хозрасчетный.НайтиПоКоду("20.01");
		Док.ПодразделениеЗатрат = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("АБЗ ""Исток""");
		Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Док.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости;
		
		Док.Комментарий = "Автоматически загружен "+Формат(ТекущаяДата(),"ДЛФ=DDT");
		
		ТекНоменклатура = Результат.Номенклатура;
		ТекКоличество = Результат.Нетто;
		
		СтрокаТабличнойЧасти = Док.Продукция.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
		СтрокаТабличнойЧасти.ПлановаяСтоимость = 1650;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, Док.ЭтотОбъект);
		
		////Док.ПриИзмененииПродукции(СтрокаТабличнойЧасти, "Продукция");
		
		Ценообразование.ЗаполнитьПлановуюСебестоимость(СтрокаТабличнойЧасти, НачДата);
		ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти);
		
		Док.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Продукция", Истина);
		ЗаполнитьНоменклатурнуюГруппу(СтрокаТабличнойЧасти);
		
		СтрокаТабличнойЧасти.Количество = ТекКоличество;
        СтрокаТабличнойЧасти.Спецификация = Результат.Спецификация;
		
		ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти);
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		исключение
			Сообщить("Не удалось провести отчет по производству за смену "+док.Номер);
		конецпопытки;

		Если НачалоДня(ДатаДок - 1) = НачалоДня(ДатаДок) Тогда 
			ДатаДок =  ДатаДок - 1;
		Иначе 
			ДатаДок = НачалоДня(ДатаДок);
		КонецЕсли; 

		ДокТребование = Документы.ТребованиеНакладная.СоздатьДокумент();
		ДокТребование.Дата = ДатаДок;
		ДокТребование.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
		ДокТребование.Записать(РежимЗаписиДокумента.Запись);

		ДокТребование.ОбработкаЗаполнения(Док.Ссылка);
		ДокТребование.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокТребование.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости;
		
		ДокТребование.Комментарий = "Автоматически загружен "+Формат(ТекущаяДата(),"ДЛФ=DDT");
		ДокТребование.Записать(РежимЗаписиДокумента.Запись);
		попытка
		ДокТребование.Записать(РежимЗаписиДокумента.Проведение);		
	исключение
		сообщить("Не удалось провести требование накладную "+ ДокТребование.Номер);
		конецпопытки;
		
	КонецЦикла;
	
КонецПроцедуры
Процедура ЗаполнитьНоменклатурнуюГруппу(СтрокаТЧ);

	СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабличнойЧастиПоТоварам()
Процедура КоманднаяПанель1УдалитьСформированные(Кнопка)
	 	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТребованиеНакладная.Ссылка
	               |ИЗ
	               |	Документ.ТребованиеНакладная КАК ТребованиеНакладная
	               |ГДЕ
	               |	ТребованиеНакладная.Дата МЕЖДУ &НачДата И &КонДата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетПроизводстваЗаСмену.Ссылка
	               |ИЗ
	               |	Документ.ОтчетПроизводстваЗаСмену КАК ОтчетПроизводстваЗаСмену
	               |ГДЕ
	               |	ОтчетПроизводстваЗаСмену.Дата МЕЖДУ &НачДата И &КонДата";
	Запрос.УстановитьПараметр("НачДата", НачалоДня(НачДата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(НачДата));
	
	РЕзультат = Запрос.Выполнить().Выбрать();
	Пока РЕзультат.Следующий() Цикл 
		ТекДок = РЕзультат.Ссылка;	
		если Найти(ТекДок.Комментарий,"Автоматически загружен ")>0 Тогда 
			Док = ТекДок.ПолучитьОбъект();
	Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Док.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
