Функция ОтправитьПочту(СтрПисьма) Экспорт   
	
	Если СокрЛП(СтрПисьма.АдресПолучателя) = "" Тогда
		Сообщить("Не указан адрес электронной почты получателя !!!");
		Возврат Ложь;
	КонецЕсли;	
	
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	ПочтовыйПрофиль.АдресСервераSMTP = "smtp.mail.ru";
	ПочтовыйПрофиль.ПарольSMTP = "Abz123456sv1";
	ПочтовыйПрофиль.ПользовательSMTP = "abzsv@mail.ru";
	
	ПочтовыйПрофиль.ПортSMTP = 465;
	ПочтовыйПрофиль.ПортPOP3 = 995;
	ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
	ПочтовыйПрофиль.ИспользоватьSSLPOP3 = Истина;
	ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Возврат Ложь; 
	КонецПопытки;
	
	Сообщение = новый ИнтернетПочтовоеСообщение;
	АдресОтправителя = "abzsv@mail.ru";
	
	МассивПолучатели = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрПисьма.АдресПолучателя, ";");
    
	 Для Каждого Элемент Из МассивПолучатели Цикл
        Получатель = Сообщение.Получатели.Добавить(Элемент);
		Адрес	= Сообщение.Получатели.Добавить(Элемент, );
    КонецЦикла;
			
	Сообщение.Отправитель.Адрес					= АдресОтправителя;
	Сообщение.Отправитель.ОтображаемоеИмя		= АдресОтправителя;
	Сообщение.Тема								=  СокрЛП(СтрПисьма.ТемаСообщения);   
	Сообщение.ОбратныйАдрес.Добавить(АдресОтправителя);
	Для Каждого ТекВложение из СтрПисьма.ИмяФайлаВложения Цикл
		Сообщение.Вложения.Добавить(ТекВложение.Значение);
	КонецЦикла;
	Сообщение.Тексты.Добавить(СтрПисьма.ТекстСообщения);
	Попытка
		Почта.Послать(Сообщение);
	Исключение
		Сообщить("Сообщение по адресу "+Строка(СтрПисьма.АдресПолучателя)+" не отправлено!"+ОписаниеОшибки());
	КонецПопытки;
	
	
	Возврат Истина;
	
КонецФункции		

Функция ОтправитьПоЕмайл(сТабДокументов) Экспорт
	НадписьКонтрагент = сТабДокументов.Контрагент.Наименование;
	
	Емайл = сТабДокументов.EMail;
	Если Емайл = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	СЗВложений = Новый СписокЗначений;
	Для Каждого СтрВложений из Вложения Цикл 
		СЗВложений.Добавить(СокрЛП(СтрВложений.ПутьКФайлу));
	КонецЦикла;
	
	ИмяФайлаВложения = КаталогВременныхФайлов()+НадписьКонтрагент+".doc";
	ФайлПроверкаСуществования = Новый Файл(ИмяФайлаВложения);
	Если ФайлПроверкаСуществования.Существует() Тогда
		СЗВложений.Добавить(ИмяФайлаВложения);
	КонецЕсли;
	
	СтрПисьма = Новый Структура("АдресПолучателя,ИмяФайлаВложения,ТекстСообщения,ТемаСообщения,ВысокаяВажность",
	Емайл,СЗВложений,ТекстСообщения,ТемаСообщения,Ложь);
	Если ОтправитьПочту(СтрПисьма) Тогда
		Возврат Истина;//Успешно
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЕмайлКонтрагента(Контрагент) Экспорт 
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Электронная почта"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Сообщить("Не найден e-mail для контрагента: " + Строка(Контрагент));
		Возврат Неопределено;
	КонецЕсли;
	ЕмайлКонтрагента = Неопределено;	
	Пока Выборка.Следующий() Цикл
		ЕмайлКонтрагента = СокрЛП(Выборка.Представление);	
	КонецЦикла;
	
	Возврат ЕмайлКонтрагента;
КонецФункции	

Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция СформироватьФайлWordИзШаблона(сТабДокументов)
	Задолженность = сТабДокументов.Задолженность;
	Номер = сТабДокументов.НомерСтроки;
	Дата = ТекущаяДата();
	НадписьКонтрагент = сТабДокументов.Контрагент.Наименование;
	НадписьДиректор  = сТабДокументов.Контрагент.Директор;
	Если НадписьДиректор = "" Тогда 
		НадписьДиректор = " ";
	КонецЕсли;
	
	Задолженность = ОбщегоНазначения.ФорматСумм(сТабДокументов.Задолженность);
	
	Попытка
		Word = ПолучитьCOMОбъект(,"Word.Application");
	Исключение
		Word = Новый COMОбъект("Word.Application");
	КонецПопытки;	
	
	Word.Application.Visible = 1;
	Word.Application.Activate();
	ФайлПроверкаСуществования = Новый Файл(Путь_к_файлу_MSWord);
	Если ФайлПроверкаСуществования.Существует() Тогда
		
		Word.Application.Documents.Add(Путь_к_файлу_MSWord);
		сч1 = 1;
		Пока сч1 <= Word.Application.ActiveDocument.Fields.Count Цикл
			Если Word.Application.ActiveDocument.Fields(сч1).Type = 64 Тогда 
				ДокВар = СокрЛП(
				Сред(СокрЛП(Word.Application.ActiveDocument.Fields(сч1).Code.Text)
				, Найти(Word.Application.ActiveDocument.Fields(сч1).Code.Text, "DOCVARIABLE ")+СтрДлина("DOCVARIABLE ")-1
				, (Найти(Word.Application.ActiveDocument.Fields(сч1).Code.Text, "\*")-1) - (Найти(Word.Application.ActiveDocument.Fields(сч1).Code.Text, "DOCVARIABLE ")+СтрДлина("DOCVARIABLE ")-1)
				)
				);
				Если Лев(ДокВар,1) = """" Тогда
					ДокВар = Прав(ДокВар, СтрДлина(ДокВар)-1);
				КонецЕсли;	
				Если Прав(ДокВар,1) = """" Тогда 
					ДокВар = Лев(ДокВар, СтрДлина(ДокВар)-1);
				КонецЕсли;	
				ДокВар = СтрЗаменить(ДокВар,"\\\","\\");
				ДокВар = СтрЗаменить(ДокВар,"\\","\");
				//Сообщить("Переменная Word = "+ДокВар);
				Если Word.Application.ActiveDocument.Variables.Item(ДокВар) = Неопределено Тогда
					Word.Application.ActiveDocument.Variables.Add(ДокВар);
				КонецЕсли;
				
				ДокВар_Выражение1С = ДокВар;
				ДокВар_Выражение1С = СтрЗаменить(ДокВар_Выражение1С,"\\\","\\");
				ДокВар_Выражение1С = СтрЗаменить(ДокВар_Выражение1С,"\\","\");
				
				ДокВар_Выражение1С = СтрЗаменить(ДокВар_Выражение1С,"\""","""");
				Если Лев(ДокВар_Выражение1С,1) = """" Тогда
					ДокВар_Выражение1С = Прав(ДокВар_Выражение1С, СтрДлина(ДокВар_Выражение1С)-1);
				КонецЕсли;	
				
				Если Прав(ДокВар_Выражение1С,1) = """" Тогда 
					ДокВар_Выражение1С = Лев(ДокВар_Выражение1С, СтрДлина(ДокВар_Выражение1С)-1);
				КонецЕсли;
				
				Если ТипЗнч(Вычислить(ДокВар_Выражение1С)) = Тип("Дата") Тогда 
					ДокВар_Выражение1С = "Формат("+ДокВар_Выражение1С+",""ДФ=dd.MM.yyyy"")";
				КонецЕсли;
				Word.Application.ActiveDocument.Variables.Item(ДокВар).Value = Вычислить(ДокВар_Выражение1С);
			КонецЕсли;	//Если Word.Application.ActiveDocument.Fields(сч1).Type = 64 Тогда 
			сч1 = сч1 + 1;
		КонецЦикла;
		Word.Application.ActiveDocument.Fields.Update();
		Word.Application.ActiveDocument.SaveAs(КаталогВременныхФайлов()+НадписьКонтрагент+".doc");
		Word.Application.ActiveDocument.Close(True);
		Word.Application.Quit(True); 
	Иначе //Если ФайлПроверкаСуществования.Существует() Тогда
		Сообщить("Файл шаблона("+ФайлПроверкаСуществования.ПолноеИмя+") не обнаружен!", СтатусСообщения.Важное);
		Предупреждение("Файл шаблона("+ФайлПроверкаСуществования.ПолноеИмя+") не обнаружен!", 10, "Ошибка!");
	КонецЕсли;	
	
КонецФункции

Процедура КоманднаяПанель3ОтправитьПоЕмайл(Кнопка)
	Если Организация.Пустая() Тогда
		Сообщить("Не указана Организация !!!");
		Возврат;
	КонецЕсли;	
	Ответ = Вопрос("Отправить письма выбранным контрагентам по e-mail?",РежимДиалогаВопрос.ДаНет,15,КодВозвратаДиалога.Нет);
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ФайлПроверкаСуществования = Новый Файл(Путь_к_файлу_MSWord);
	Если НЕ ФайлПроверкаСуществования.Существует() Тогда
		Ответ = Вопрос("Не выбран шаблон Word. Отправить письма без шаблона?",РежимДиалогаВопрос.ДаНет,15,КодВозвратаДиалога.Нет);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;

	
	Для Каждого сТабДокументов Из ТабДокументов Цикл
		Если сТабДокументов.ОтправитьПоЕмайл Тогда
			ФайлПроверкаСуществования = Новый Файл(Путь_к_файлу_MSWord);
			Если ФайлПроверкаСуществования.Существует() Тогда
				СформироватьФайлWordИзШаблона(сТабДокументов);
			КонецЕсли;
			Успешно = ОтправитьПоЕмайл(сТабДокументов);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура КоманднаяПанель4Заполнить(Кнопка)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК Задолженность
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ТекДата, Счет = &Сч, , Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|	И ВЫБОР
	|			КОГДА &ЕстьФильтрПоПервойБукве
	|				ТОГДА (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1.Наименование КАК СТРОКА(1))) = &ФильтрПоПервойБукве
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1.Наименование";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Сч", ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01"));
	Запрос.УстановитьПараметр("ЕстьФильтрПоПервойБукве", СокрЛП(ФильтрПоПервойБукве) <> "");
	Запрос.УстановитьПараметр("ФильтрПоПервойБукве", ФильтрПоПервойБукве);
	
	ТабДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого сТЧ из ТабДокументов Цикл
		сТЧ.EMail = ПолучитьЕмайлКонтрагента(сТЧ.Контрагент);
		сТЧ.Директор = сТЧ.Контрагент.Директор;
	КонецЦикла;
КонецПроцедуры

Процедура Путь_к_файлу_MSWordНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Вставить содержимое обработчика.
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл шаблона MS Word";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.Фильтр =   "Формат DOС (*.doc)|*.doc|"; 
	
	Если Диалог.Выбрать() Тогда
		Элемент.Значение = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура КоманднаяПанель1ОтметитьВсе(Кнопка)
	ТаблицаРегистра=ЭлементыФормы.ТабДокументов;
	Т=Неопределено; 
	Выполнить("Т="+ТаблицаРегистра.Данные);
	
	Для Каждого Стр ИЗ Т Цикл
		ТаблицаРегистра.ТекущаяСтрока=Стр;
		Если ТаблицаРегистра.ТекущаяСтрока=Стр Тогда
			Стр.ОтправитьПоЕмайл = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанель1СнятьВсеОтметки(Кнопка)
	ТаблицаРегистра=ЭлементыФормы.ТабДокументов;
	Т=Неопределено; 
	Выполнить("Т="+ТаблицаРегистра.Данные);
	
	Для Каждого Стр ИЗ Т Цикл
		ТаблицаРегистра.ТекущаяСтрока=Стр;
		Если ТаблицаРегистра.ТекущаяСтрока=Стр Тогда
			Стр.ОтправитьПоЕмайл = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ТабДокументовКонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.Значение) Тогда 
		ТекущийЭлемент.ТекущиеДанные.EMail  = ПолучитьЕмайлКонтрагента(Элемент.Значение);
		ТекущийЭлемент.ТекущиеДанные.Директор = Элемент.Значение.Директор;
	Иначе 
		ТекущийЭлемент.ТекущиеДанные.EMail  = "";	
		ТекущийЭлемент.ТекущиеДанные.Директор = "";
	КонецЕсли;
КонецПроцедуры

//Процедура КоманднаяПанель4ДействиеПодбор(Кнопка)
//	
//	ДействиеПодбор(ТабДокументов);

//КонецПроцедуры
//Процедура ДействиеПодбор(ТабличнаяЧасть)

//	Перем Команда, Валюта;

//	ЕстьЦена  = Истина;

//	Если ТабличнаяЧасть = ТабДокументов Тогда
//		
//		Команда = "ПодборВТабличнуюЧастьТовары";
//		Валюта  = ВалютаДокумента;
//		ИмяТабличнойЧасти = "ТабДокументов";

//	КонецЕсли;
//	
//	СписокВидовПодбора = СформироватьСписокЗапросовДляПодбора(ТабличнаяЧасть);
//	ПредставлениеДок = Метаданные().Представление();

//	СтруктураПараметровПодбора = Новый Структура();
//	СтруктураПараметровПодбора.Вставить("Команда"              , Команда);
//	СтруктураПараметровПодбора.Вставить("СписокВидовПодбора"   , СписокВидовПодбора);
//	
//	// Параметры запросов.
//	//ВременнаяДатаРасчетов = ?(НачалоДня(Дата) = НачалоДня(ТекущаяДата()), Неопределено, Дата);
//	//СтруктураПараметровПодбора.Вставить("ДатаРасчетов"         , ВременнаяДатаРасчетов);
//	//СтруктураПараметровПодбора.Вставить("Склад"                , Склад);
//	//СтруктураПараметровПодбора.Вставить("ТипЦен"               , ТипЦен);
//	СтруктураПараметровПодбора.Вставить("Контрагент"           , Контрагент);
//	//СтруктураПараметровПодбора.Вставить("ДоговорКонтрагента"   , ДоговорКонтрагента);
//	//СтруктураПараметровПодбора.Вставить("Организация"          , Организация);
//	//СтруктураПараметровПодбора.Вставить("СпособЗаполненияЦен"  , Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов);
//	//СтруктураПараметровПодбора.Вставить("ЕстьЦена"             , ЕстьЦена);
//	//СтруктураПараметровПодбора.Вставить("ВалютаДокумента"      , Валюта);
//	СтруктураПараметровПодбора.Вставить("Заголовок", "Подбор контрагентов ";

//	РаботаСДиалогами.ОткрытьПодборНоменклатуры( Номенклатуры(ЭтаФорма, СтруктураПараметровПодбора, мФормаПодбораНоменклатуры);

//КонецПроцедуры // ДействиеПодбор()

Функция СформироватьСписокЗапросовДляПодбора(ТабличнаяЧасть)
	
	СписокЗапросов = Новый СписокЗначений();
	СписокЗапросов.Добавить(,"По справочнику");
	
	Если (ТабличнаяЧасть = ТабДокументов) Тогда
		//СписокЗапросов.Добавить("ЦеныНоменклатуры", "Цены номенклатуры");
		//СписокЗапросов.Добавить("ОстаткиНоменклатуры", "Остатки номенклатуры");
		//СписокЗапросов.Добавить("ОстаткиИЦеныНоменклатуры", "Остатки и цены номенклатуры");
	КонецЕсли;
	
	Возврат СписокЗапросов;
	
КонецФункции 


Процедура КоманднаяПанель4Подбор(Кнопка)
	ФормаПодбора = Справочники.Контрагенты.ПолучитьФормуВыбора(,ЭтаФорма); 
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь; 
	ФормаПодбора.Открыть(); 
КонецПроцедуры


Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Если ЗначениеВыбора.ЭтоГруппа Тогда 
			Если Вопрос("Добавить всех контрагентов из папки?", 
				РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Контрагенты.Ссылка
				|ИЗ
				|	Справочник.Контрагенты КАК Контрагенты
				|ГДЕ
				|	Контрагенты.Родитель = &Родитель";
				Запрос.УстановитьПараметр("Родитель", ЗначениеВыбора);
				Результат = Запрос.Выполнить().Выбрать();
				
				Пока Результат.Следующий() Цикл 
					ЗначениеВыбора = Результат.Ссылка;	
					Строка = ТабДокументов.Найти(ЗначениеВыбора,"Контрагент"); 
					Если Строка = Неопределено Тогда 
						Строка = ТабДокументов.Добавить(); 
						Строка.Контрагент = ЗначениеВыбора; 
						Строка.EMail  = ПолучитьЕмайлКонтрагента(Строка.Контрагент);
						Строка.Директор =Строка.Контрагент.Директор;
						Если ЗначениеЗаполнено(Строка.EMail) Тогда 
							Строка.ОтправитьПоЕмайл = Истина
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; 
		Иначе
			Строка = ТабДокументов.Найти(ЗначениеВыбора,"Контрагент"); 
			Если Строка = Неопределено Тогда 
				Строка = ТабДокументов.Добавить(); 
				Строка.Контрагент = ЗначениеВыбора; 
				Строка.EMail  = ПолучитьЕмайлКонтрагента(Строка.Контрагент);
				Строка.Директор =Строка.Контрагент.Директор;
				Если ЗначениеЗаполнено(Строка.EMail) Тогда 
					Строка.ОтправитьПоЕмайл = Истина
				КонецЕсли;
			Иначе 
				Сообщить("Такой контрагент уже есть в списке")
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры


Процедура ВложенияПередНачаломДобавления(Элемент, Отказ, Копирование)
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для вложения в письмо";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.Фильтр =   "Файл (*.*)|*.*|"; 
	
	Если Диалог.Выбрать() Тогда
		НовСтр = Вложения.Добавить();
		НовСтр.ПутьКФайлу = Диалог.ПолноеИмяФайла; 
		Отказ = Истина;
		Возврат
	Иначе
		Возврат;
	КонецЕсли;	

КонецПроцедуры

