Перем АБЗИсток,АБЗИстокКонтрагент;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	АБЗИсток = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СобственныеКонтрагенты.Организация,
	|	СобственныеКонтрагенты.Контрагент
	|ИЗ
	|	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|ГДЕ
	|	СобственныеКонтрагенты.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", АБЗИсток);
	РЕзультат = Запрос.Выполнить().Выбрать();
	
	Пока РЕзультат.Следующий() Цикл 
		АБЗИстокКонтрагент = РЕзультат.Контрагент	
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |	И РеализацияТоваровУслуг.ЗаведеноАвтоматическиПоОтгрузкам
	               |	И РеализацияТоваровУслуг.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |	И ПоступлениеТоваровУслуг.ЗаведеноАвтоматическиПоОтгрузкам
	               |	И ПоступлениеТоваровУслуг.Контрагент = &АБЗИстокКонтрагент";
	
	Запрос.УстановитьПараметр("Организация", АБЗИсток);
	Запрос.УстановитьПараметр("АБЗИстокКонтрагент", АБЗИстокКонтрагент);
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	
	РЕзультат = Запрос.Выполнить().Выбрать();
	Пока РЕзультат.Следующий() Цикл 
		ТекДок = РЕзультат.Ссылка;	
		Док = ТекДок.ПолучитьОбъект();
		Док.ПометкаУдаления = Истина;
		Док.Записать();
		//Если РеальноУдалять Тогда 
		//	Док.Удалить();
		//КонецЕсли;

	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РеализацияТоваровУслугТовары.КоличествоФакт) КАК Количество,
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.Ссылка.Организация
	               |ПОМЕСТИТЬ РеализацииОтбор
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	               |	И РеализацияТоваровУслугТовары.Ссылка.ВнутреннийНомерНакладной > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.Ссылка.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацииОтбор.Количество,
	               |	РеализацииОтбор.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Цена,
	               |	ЦеныНоменклатурыСрезПоследних.Цена * РеализацииОтбор.Количество КАК Сумма,
	               |	РеализацииОтбор.Организация
	               |ПОМЕСТИТЬ Запрос
	               |ИЗ
	               |	РеализацииОтбор КАК РеализацииОтбор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&КонДата, ТипЦен = &Себестоимость) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО РеализацииОтбор.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Запрос.Количество,
	               |	Запрос.Номенклатура,
	               |	Запрос.Цена,
	               |	Запрос.Сумма,
	               |	Запрос.Организация КАК Организация
	               |ИЗ
	               |	Запрос КАК Запрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураДляФормированияОтгрузокТовара КАК НоменклатураДляФормированияОтгрузокТовара
	               |		ПО Запрос.Номенклатура = НоменклатураДляФормированияОтгрузокТовара.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организация";
	
	
	Себестоимость = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Себестоимость");
	
	Запрос.УстановитьПараметр("Себестоимость",Себестоимость);
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	//	 1. по предыдущему дню на основании продаж, сделать сделующие доки. 
	//Отгрузка от абз на строй св ровно такое кол-во тонн асф, сколько отгрузили, 
	//отгрузка от абз на строй ритейл, отгрузка от абз на тд исток. (Если такие продажи были естественно)
	//. Ну и соответственно сразу же док-нит поступление  формировался на св,ритейл и тд.
	ТекСклад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	ТекОрганизация = Справочники.Организации.ПустаяСсылка();
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		
		Если РЕзультат.Организация = АБЗИсток Тогда 
			Продолжить;
		КонецЕсли;
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СобственныеКонтрагенты.Организация,
		               |	СобственныеКонтрагенты.Контрагент
		               |ИЗ
		               |	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
		               |ГДЕ
		               |	СобственныеКонтрагенты.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", РЕзультат.Организация);
		РЕзультат1 = Запрос.Выполнить().Выбрать();
		
		Пока РЕзультат1.Следующий() Цикл 
			ТекКонтрагент = РЕзультат1.Контрагент;	
		КонецЦикла;
		
		Если ТекКонтрагент = "" Тогда 
			//Предупреждение("Не найден собственный контрагент для "+ ТекОрганизация);
			Возврат;
		КонецЕсли;
		
		СоздаемНовый = Ложь;
			
		Если ТекОрганизация <> РЕзультат.Организация Тогда 
			СоздаемНовый = Истина;
			ТекОрганизация = РЕзультат.Организация;
			Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Док.Дата = НачалоДня(НачДата)+1;
			
			Док.Организация = АБЗИсток;
			Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
			Док.СуммаВключаетНДС = Истина;
			Док.УчитыватьНДС = Истина;
			Док.Склад = ТекСклад;
			Док.Контрагент = ТекКонтрагент;
			Док.ДоговорКонтрагента = ТекКонтрагент.ОсновнойДоговорКонтрагента;
			Док.ВалютаДокумента = Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Док.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
			Док.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
			
			СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ТекОрганизация , ТекКонтрагент, ТекКонтрагент.ОсновнойДоговорКонтрагента);
		КонецЕсли;
		
		СтрДок = Док.ЭтотОбъект.Товары.Добавить();
		СтрДок.Номенклатура = РЕзультат.Номенклатура;
		СтрДок.Количество = РЕзультат.Количество;
		СтрДок.ЕдиницаИзмерения = СтрДок.Номенклатура.БазоваяЕдиницаИзмерения;
		СтрДок.Цена = РЕзультат.Цена;
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрДок, Док);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиФакт(СтрДок, Док);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧастиФакт(СтрДок, Док);
		Док.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрДок, "Товары", Истина);
		Док.ЗаполнитьСчетаУчетаРасчетов(СчетаУчета);		
		Док.Комментарий = "Занесено автоматически из обработки формирование внутренних накладных на товары.";
		Док.ЗаведеноАвтоматическиПоОтгрузкам = Истина;
		//Док.ДокументОснование = ТекПоступление;
		
		Док.Записать();
		Сообщить("Создан "+Док);
		
		ТекРеализация = Док.Ссылка;
		
		Если СоздаемНовый Тогда 
		Док2 = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		Док2.Дата = НачалоДня(НачДата)+2;
		Док2.Организация = ТекОрганизация;
		Док2.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		Док2.СуммаВключаетНДС = Истина;
		Док2.УчитыватьНДС = Истина;
		Док2.Склад = ТекСклад;
		Док2.Контрагент = АБЗИстокКонтрагент;
		Док2.ДоговорКонтрагента = АБЗИстокКонтрагент.ОсновнойДоговорКонтрагента;
		Док2.ВалютаДокумента = АБЗИстокКонтрагент.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов;
		Док2.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		Док2.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ТекОрганизация, АБЗИстокКонтрагент, АБЗИстокКонтрагент.ОсновнойДоговорКонтрагента);
		
		СтрДок = Док2.ЭтотОбъект.Товары.Добавить();
		СтрДок.Номенклатура = РЕзультат.Номенклатура;
		СтрДок.Количество = РЕзультат.Количество;
		СтрДок.ЕдиницаИзмерения = РЕзультат.Номенклатура.БазоваяЕдиницаИзмерения;
		СтрДок.Цена = РЕзультат.Цена;
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрДок, Док2);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док2);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док2);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиФакт(СтрДок, Док2);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧастиФакт(СтрДок, Док2);
		Док2.ЗаполнитьСчетаУчетаВТабЧасти(Док2.Товары        , "Товары"        , Истина, Истина);
		Док2.ЗаполнитьСчетаУчетаРасчетов(СчетаУчета);	
		Док2.Комментарий = "Занесено автоматически из обработки формирование внутренних накладных на товары.";
		Док2.ДокументОснование = ТекРеализация.Ссылка;
		Док2.ЗаведеноАвтоматическиПоОтгрузкам = Истина;
		
		Док2.Записать();
		Сообщить("Создан "+Док2);
	КонецЦикла;
	

	
КонецПроцедуры

Процедура КоманднаяПанель1УдалитьСформированные(Кнопка)
	
	АБЗИсток = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СобственныеКонтрагенты.Организация,
	|	СобственныеКонтрагенты.Контрагент
	|ИЗ
	|	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|ГДЕ
	|	СобственныеКонтрагенты.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", АБЗИсток);
	РЕзультат = Запрос.Выполнить().Выбрать();
	
	Пока РЕзультат.Следующий() Цикл 
		АБЗИстокКонтрагент = РЕзультат.Контрагент	
	КонецЦикла;

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |	И РеализацияТоваровУслуг.ЗаведеноАвтоматическиПоОтгрузкам
	               |	И РеализацияТоваровУслуг.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |	И ПоступлениеТоваровУслуг.ЗаведеноАвтоматическиПоОтгрузкам
	               |	И ПоступлениеТоваровУслуг.Контрагент = &АБЗИстокКонтрагент";
	
	Запрос.УстановитьПараметр("Организация", АБЗИсток);
	Запрос.УстановитьПараметр("АБЗИстокКонтрагент", АБЗИстокКонтрагент);
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	
	РЕзультат = Запрос.Выполнить().Выбрать();
	Пока РЕзультат.Следующий() Цикл 
		ТекДок = РЕзультат.Ссылка;	
		Док = ТекДок.ПолучитьОбъект();
		Док.ПометкаУдаления = Истина;
		Док.Записать();
		Если РеальноУдалять Тогда 
			Док.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
