
Функция ПолучитьПоследнийНомерНаДату()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Дата < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И СчетФактураВыданный.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(СчетФактураВыданный.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураВыданный.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата",НачПериода);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	
	Возврат Результат.Номер;
	
КонецФункции

Процедура ЗаполнитьДокументы()
	
	ТабличноеПолеДокументы.Очистить();
	
	ПослНомерСтрока = НомерПервойСФ;
	
	ПослНомер = Число(СРед(ПослНомерСтрока,Найти(ПослНомерСтрока,"0")));
	
	//новые номера
	
	СчФВыборка = Документы.СчетФактураВыданный.Выбрать(НачПериода ,КонецДня(КонПериода), Новый Структура("Организация", Организация));
	
	Пока СчФВыборка.Следующий() Цикл
		
		Док = СчФВыборка.Ссылка.ПолучитьОбъект();
		
		СтарыйНомер = Док.Номер;
		
		//Док.УстановитьНовыйНомер();
		Если Док.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда 

			Док.Номер = СтрЗаменить("АВ"+ Сред(СтрЗаменить(Док.Номер, СтрЗаменить(Строка(Число(СРед(Док.Номер,Найти(Док.Номер,"0")))),Символы.НПП,""), Строка(ПослНомер+1)),3),Символы.НПП,"");
			//Док.Номер = СтрЗаменить("АВ"+СтрЗаменить(СтрЗаменить(СтрЗаменить(Док.Номер, СтрЗаменить(Строка(Число(СРед(Док.Номер,Найти(Док.Номер,"0")))),Символы.НПП,""), Строка(ПослНомер+1))," ",""),Символы.НПП,""),Символы.НПП,"");
		Иначе 
			Док.Номер = СтрЗаменить(СтрЗаменить(СтрЗаменить(Док.Номер, СтрЗаменить(Строка(Число(СРед(Док.Номер,Найти(Док.Номер,"0")))),Символы.НПП,""), Строка(ПослНомер+1))," ",""),Символы.НПП,"");
		КонецЕсли;
		ПослНомер = ПослНомер + 1;
		//
		//Сообщить("Счет-фактуре "+СтарыйНомер+" будет присвоен номер "+Док.Номер);
		
		НоваяСтрока = ТабличноеПолеДокументы.Добавить();
		НоваяСтрока.СчетФактура = Док.Ссылка;
		НоваяСтрока.СтарыйНомер = СтарыйНомер;
		НоваяСтрока.НовыйНомер = Док.Номер;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если НЕ Вопрос("Внимание!!! Будет произведена перенумерация всех счетов-фактур 
		|по организации "+СокрЛП(Организация)+" начиная с даты "+НачПериода+"! ПРОДОЛЖИТЬ?", РежимДиалогаВопрос.ДаНет, 60)=КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	//врем номера
	Для Каждого СтрокаДок из ТабличноеПолеДокументы Цикл
		               
		Док = СтрокаДок.СчетФактура.ПолучитьОбъект();
		Док.ОбменДанными.Загрузка = Истина;
		
		Док.Номер = "ВРМ" + Сред(Док.Номер, 4);
		
		Док.Записать();
		
	КонецЦикла;	
	
	//новые номера
	Для Каждого СтрокаДок из ТабличноеПолеДокументы Цикл
		               
		Док = СтрокаДок.СчетФактура.ПолучитьОбъект();
		
		Док.Номер = СтрокаДок.НовыйНомер;
		
		Сообщить("Счет-фактуре "+СтрокаДок.СтарыйНомер+" присвоен номер "+СтрокаДок.НовыйНомер);
		
		Док.Записать();
		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
	ЭлементыФормы.ТабличноеПолеДокументы.ОбновитьСтроки();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаполнить(Кнопка)
	
	ЗаполнитьДокументы();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтменить(Кнопка)
	
	Если НЕ Вопрос("Внимание!!! Будет произведена ОТМЕНА перенумерации счетов-фактур!
		|ПРОДОЛЖИТЬ?", РежимДиалогаВопрос.ДаНет, 60)=КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	//новые номера
	Для Каждого СтрокаДок из ТабличноеПолеДокументы Цикл
		               
		Док = СтрокаДок.СчетФактура.ПолучитьОбъект();
		
		Сообщить("Счет-фактуре "+Док.Номер+" присвоен номер "+СтрокаДок.СтарыйНомер);
		
		Док.Номер = СтрокаДок.СтарыйНомер;
		
		Док.Записать();
		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
	ЭлементыФормы.ТабличноеПолеДокументы.ОбновитьСтроки();
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	НомерПервойСФ = ПолучитьПоследнийНомерНаДату();

КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
	НомерПервойСФ = ПолучитьПоследнийНомерНаДату();
КонецПроцедуры


Процедура НачПериодаПриИзменении(Элемент)
	НомерПервойСФ = ПолучитьПоследнийНомерНаДату();
КонецПроцедуры


Процедура ПриОткрытии()
	НомерПервойСФ = ПолучитьПоследнийНомерНаДату();
КонецПроцедуры

