
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Нетто,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ НоменклатураКоличество
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.ВнутреннийНомерНакладной > 0
	               |	И РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпецификацииНоменклатуры.Ссылка КАК Спецификация,
	               |	НоменклатураКоличество.Нетто,
	               |	НоменклатураКоличество.Номенклатура
	               |ИЗ
	               |	НоменклатураКоличество КАК НоменклатураКоличество
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	               |		ПО НоменклатураКоличество.Номенклатура.Ссылка = СпецификацииНоменклатуры.Владелец";
	
	Запрос.УстановитьПараметр("НачДата", НачалоДня(НачДата));
	Запрос.УстановитьПараметр("КонДата", КонецДня(НачДата));
	
	Док = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
	Док.Дата = НачалоДня(НачДата)+1;
	Док.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""АБЗ ""Исток""");
    Док.Склад = Справочники.Склады.НайтиПоНаименованию("Основной склад");
	Док.ИспользоватьМатериалы = Истина;
	док.СчетЗатрат = ПланыСчетов.Хозрасчетный.НайтиПоКоду("20.01");
	Док.ПодразделениеЗатрат = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("АБЗ ""Исток""");
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Док.Комментарий = "Автоматически загружен "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	ЕстьЗаписиВТаблице = Ложь;
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		ТекНоменклатура = Результат.Номенклатура;
		ТекКоличество = Результат.Нетто;
		
		СтрокаТабличнойЧасти = Док.Продукция.Добавить();
		СтрокаТабличнойЧасти.Номенклатура = ТекНоменклатура;
		СтрокаТабличнойЧасти.ПлановаяСтоимость = 1650;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, Док.ЭтотОбъект);
		
		////Док.ПриИзмененииПродукции(СтрокаТабличнойЧасти, "Продукция");
		
		Ценообразование.ЗаполнитьПлановуюСебестоимость(СтрокаТабличнойЧасти, НачДата);
		ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти);
		
		Док.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, "Продукция", Истина);
		ЗаполнитьНоменклатурнуюГруппу(СтрокаТабличнойЧасти);
		
		СтрокаТабличнойЧасти.Количество = ТекКоличество;
        СтрокаТабличнойЧасти.Спецификация = Результат.Спецификация;
		
		ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти);

		
        ЕстьЗаписиВТаблице = Истина;
	КонецЦикла;
	
	Если ЕстьЗаписиВТаблице Тогда 
		Док.Записать();
		ДокТребование = Документы.ТребованиеНакладная.СоздатьДокумент();
		ДокТребование.Дата = НачалоДня(НачДата);
		ДокТребование.ОбработкаЗаполнения(Док.Ссылка);
		ДокТребование.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		ДокТребование.Комментарий = "Автоматически загружен "+Формат(ТекущаяДата(),"ДЛФ=DDT");
		ДокТребование.Записать()
	КонецЕсли;

КонецПроцедуры
Процедура ЗаполнитьНоменклатурнуюГруппу(СтрокаТЧ);

	СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабличнойЧастиПоТоварам()
