
//Процедура КнопкаВыполнитьНажатие(Кнопка)
//	Для Каждого СтрТЧ Из ТабличнаяЧасть1 Цикл 
//		ТекПоступление = СтрТЧ.ПоступлениеТоваров;
//		ТекРеализация = СтрТЧ.РеализацияТоваров;
//		ТекПоступлениеПоРеализации = СтрТЧ.ПоступлениеПоРеализации;
//		Сумма = СтрТЧ.Сумма;
//		Количество = СтрТЧ.Количество;
//		
//		Если ЗначениеЗаполнено(Сумма) И ЗначениеЗаполнено(Количество) Тогда 
//			Цена = (Сумма/Количество);
//			Если ТипНаценки = Перечисления.ТипНаценки.СуммаНаценки Тогда 
//				Цена = Цена + СуммаНаценки;
//			Иначе 
//				Цена = СуммаНаценки;
//			КонецЕсли;
//			
//			Если Не ЗначениеЗаполнено(ТекРеализация) Тогда 
//				Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//				Док.Дата = ТекПоступление.Дата+1;
//				Док.Организация = Организация;
//				Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
//				Док.СуммаВключаетНДС = Истина;
//				Док.УчитыватьНДС = Истина;
//				Док.Склад = ТекПоступление.Склад;
//				Док.Контрагент = Контрагент;
//				Док.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
//				Док.ВалютаДокумента = Док.ДоговорКонтрагента.ВалютаВзаиморасчетов;
//				Док.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
//				Док.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
//				
//				СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(Организация , Контрагент, Контрагент.ОсновнойДоговорКонтрагента);
//				
//				СтрДок = Док.ЭтотОбъект.Товары.Добавить();
//				СтрДок.Номенклатура = Номенклатура;
//				СтрДок.Количество = Количество;
//				СтрДок.ЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
//				СтрДок.Цена = Цена;
//				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиПоДокументу(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧастиПоДокументу(СтрДок, Док);
//				Док.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрДок, "Товары", Истина);
//				Док.ЗаполнитьСчетаУчетаРасчетов(СчетаУчета);		
//				Док.Комментарий = "Занесено автоматически из обработки формирование внутренних перемещений.";
//				Док.ДокументОснование = ТекПоступление;
//				
//				Док.Записать();
//				ТекРеализация = Док.Ссылка;
//			КонецЕсли;
//			
//			Если Не ЗначениеЗаполнено(ТекПоступлениеПоРеализации) Тогда 
//				Док = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
//				Док.Дата = ТекПоступление.Дата + 2;
//				Док.Организация = Организация2;
//				Док.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
//				Док.СуммаВключаетНДС = Истина;
//				Док.УчитыватьНДС = Истина;
//				Док.Склад = ТекПоступление.Склад;
//				Док.Контрагент = Контрагент1;
//				Док.ДоговорКонтрагента = Контрагент1.ОсновнойДоговорКонтрагента;
//				Док.ВалютаДокумента = Контрагент1.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов;
//				Док.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
//				Док.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
//				
//				СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(Организация2, Контрагент1, Контрагент1.ОсновнойДоговорКонтрагента);
//				
//				СтрДок = Док.ЭтотОбъект.Товары.Добавить();
//				СтрДок.Номенклатура = Номенклатура;
//				СтрДок.Количество = Количество;
//				СтрДок.ЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
//				СтрДок.Цена = Цена;
//				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧастиПоДокументу(СтрДок, Док);
//				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧастиПоДокументу(СтрДок, Док);
//				Док.ЗаполнитьСчетаУчетаВТабЧасти(Док.Товары        , "Товары"        , Истина, Истина);
//				Док.ЗаполнитьСчетаУчетаРасчетов(СчетаУчета);	
//				Док.Комментарий = "Занесено автоматически из обработки.";
//				Док.ДокументОснование = ТекРеализация.Ссылка;
//				
//				Док.Записать();
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	КоманднаяПанель1Заполнить("");
//КонецПроцедуры

Процедура КоманднаяПанель1Заполнить(Кнопка)
	ТабличнаяЧасть1.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
	               |	ПоступлениеТоваровУслуг.Контрагент,
	               |	ПоступлениеТоваровУслуг.Дата КАК Дата
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Организация = &Организация
	               |	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчет.Ссылка,
	               |	ПоступлениеНаРасчетныйСчет.Контрагент,
	               |	ПоступлениеНаРасчетныйСчет.Дата
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	               |ГДЕ
	               |	ПоступлениеНаРасчетныйСчет.Организация = &Организация
	               |	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачДата И &КонДата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеСРасчетногоСчета.Ссылка,
	               |	СписаниеСРасчетногоСчета.Контрагент,
	               |	СписаниеСРасчетногоСчета.Дата
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	               |ГДЕ
	               |	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачДата И &КонДата
	               |	И СписаниеСРасчетногоСчета.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка,
	               |	РеализацияТоваровУслуг.Контрагент,
	               |	РеализацияТоваровУслуг.Дата
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	               |	И РеализацияТоваровУслуг.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		НовСтрока = ТабличнаяЧасть1.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,Результат);
		
	КонецЦикла;

КонецПроцедуры

Процедура ОсновныеДействияФормыВыгрузить(Кнопка)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Путь + СтрЗаменить(Организация.Наименование+Формат(ТекущаяДата(),"ДФ=_dd_MM_yyyy")+".xml","""","_"));
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Root");   
	
	Если Организация.Наименование = "ООО ""Строй-СВ""" Тогда 
		СписокРеализация = Новый СписокЗначений;
		Для Каждого стр Из ТабличнаяЧасть1 Цикл
			Если (стр.Выгружать)И(Строка(ТипЗнч(стр.Документ.Ссылка)) =  "Реализация товаров и услуг") Тогда 
				СписокРеализация.Добавить(стр.Документ);
			КонецЕсли;
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
		               |	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
		               |	РеализацияТоваровУслугТовары.Номенклатура,
		               |	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
		               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |ГДЕ
		               |	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
		               |	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		               |	И РеализацияТоваровУслугТовары.Ссылка В(&СписокРеализация)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугТовары.Номенклатура,
		               |	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
		               |	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата,
		               |	Контрагент
		               |ИТОГИ ПО
		               |	Дата,
		               |	Контрагент";
		Запрос.УстановитьПараметр("СписокРеализация",СписокРеализация);
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("НачДата",НачДата);
		Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
		
		ВыборкаПервогоУровня = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПервогоУровня.Следующий() Цикл 
			Дата = ВыборкаПервогоУровня.Дата;
			ВыборкаВторогоУровня = ВыборкаПервогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВторогоУровня.Следующий() Цикл 
				Контрагент = ВыборкаВторогоУровня.Контрагент;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументРеализацияТоваровУслуг");  
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				
				ВыборкаТретьегоУровня = ВыборкаВторогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТретьегоУровня.Следующий() Цикл 
					Номенклатура = ВыборкаТретьегоУровня.Номенклатура;
					Сумма = ВыборкаТретьегоУровня.Сумма;
					Количество = ВыборкаТретьегоУровня.Количество;
					
					ЗаписьXML.ЗаписатьТекст("Товары");
					//Для Каждого СтрокаТЧ из стр.Документ.Товары Цикл 
						ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
						ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); 
						ЗаписьXML.ЗаписатьТекст(Номенклатура.Наименование);
						ЗаписьXML.ЗаписатьКонецЭлемента(); //Номенклатура	
						ЗаписьXML.ЗаписатьНачалоЭлемента("Количество"); 
						ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(Количество),",","."),Символы.НПП,""));
						ЗаписьXML.ЗаписатьКонецЭлемента(); //Количество	
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма"); 
						ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(Сумма),",","."),Символы.НПП,""));
						ЗаписьXML.ЗаписатьКонецЭлемента(); //Сумма	
						
						ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
					//КонецЦикла;
				КонецЦикла;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ТабЧасть	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Организация");  
				ЗаписьXML.ЗаписатьТекст(Организация.Наименование);
				ЗаписьXML.ЗаписатьКонецЭлемента(); //Организация
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");  
				ЗаписьXML.ЗаписатьТекст(Строка(Дата));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //Дата
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент");  
				ЗаписьXML.ЗаписатьТекст(Контрагент.Наименование);
				ЗаписьXML.ЗаписатьКонецЭлемента(); //Контрагент
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ДокументРеализацияТоваровУслуг              
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	
	Для Каждого стр Из ТабличнаяЧасть1 Цикл
		Если стр.Выгружать Тогда 
			Объект = стр.Документ.ПолучитьОбъект();	
			Если (Строка(ТипЗнч(Объект.Ссылка)) =  "Реализация товаров и услуг")И (Организация.Наименование = "ООО ""Строй-СВ""") Тогда 
				продолжить;
			КонецЕсли;
			Если Строка(ТипЗнч(Объект.Ссылка)) =  "Поступление товаров и услуг" Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументПоступлениеТоваровУслуг");  
				ЗаписьXML.ЗаписатьНачалоЭлемента("НомерВходящегоДокумента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НомерВходящегоДокумента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НомерВходящегоДокумента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("Товары");
				Для Каждого СтрокаТЧ из стр.Документ.Товары Цикл 
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
					ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); 
					ЗаписьXML.ЗаписатьТекст(СтрокаТЧ.Номенклатура.Наименование);
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Номенклатура	
					ЗаписьXML.ЗаписатьНачалоЭлемента("Количество"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Количество),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Количество	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Цена"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Цена),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Цена	
					ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Сумма),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Сумма	
					ЗаписьXML.ЗаписатьНачалоЭлемента("НДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СтавкаНДС),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //НДС	
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаНДС),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаНДС	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ТабЧасть	
				
			ИначеЕсли (Строка(ТипЗнч(Объект.Ссылка)) =  "Реализация товаров и услуг")И (Организация.Наименование <> "ООО ""Строй-СВ""") Тогда 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументРеализацияТоваровУслуг");  
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("Товары");
				Для Каждого СтрокаТЧ из стр.Документ.Товары Цикл 
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
					ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); 
					ЗаписьXML.ЗаписатьТекст(СтрокаТЧ.Номенклатура.Наименование);
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Номенклатура	
					ЗаписьXML.ЗаписатьНачалоЭлемента("Количество"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Количество),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Количество	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Цена"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Цена),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Цена	
					ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.Сумма),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Сумма	
					ЗаписьXML.ЗаписатьНачалоЭлемента("НДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(СтрокаТЧ.СтавкаНДС),",","."));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //НДС	
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаНДС),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаНДС	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ТабЧасть	
			ИначеЕсли Строка(ТипЗнч(Объект.Ссылка)) =  "Поступление на расчетный счет" Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеНаРасчетныйСчет");  
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ВидОперации"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ВидОперации));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ВидОперации	

				ЗаписьXML.ЗаписатьНачалоЭлемента("НомерВходящегоДокумента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НомерВходящегоДокумента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НомерВходящегоДокумента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаВходящегоДокумента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДатаВходящегоДокумента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НомерВходящегоДокумента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатьяДвиженияДенежныхСредств"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СтатьяДвиженияДенежныхСредств));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СтатьяДвиженияДенежныхСредств	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт1"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт1));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт1	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт2"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт2));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт2	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт3"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт3));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт3
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаДокумента"); 
				ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(Объект.СуммаДокумента),",","."),Символы.НПП,""));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаДокумента	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетКонтрагента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетКонтрагента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетКонтрагента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовСКонтрагентом"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетУчетаРасчетовСКонтрагентом));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовСКонтрагентом	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетБанк"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетБанк));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетБанк
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("НазначениеПлатежа");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НазначениеПлатежа));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НазначениеПлатежа
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаУслуг"); 
				ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(Объект.СуммаУслуг),",","."),Символы.НПП,""));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаУслуг	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПодразделениеКт"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ПодразделениеКт));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ПодразделениеКт
				//
				//
				//ЗаписьXML.ЗаписатьНачалоЭлемента("ФизЛицо"); 
				//ЗаписьXML.ЗаписатьТекст(Строка(Объект.ФизЛицо));
				//ЗаписьXML.ЗаписатьКонецЭлемента(); //ФизЛицо
				//
				//ЗаписьXML.ЗаписатьНачалоЭлемента("ДоговорЗайма"); 
				//ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДоговорЗайма));
				//ЗаписьXML.ЗаписатьКонецЭлемента(); //ДоговорЗайма
				//

				//ЗаписьXML.ЗаписатьНачалоЭлемента("НеПодтвержденоВыпискойБанка"); 
				//ЗаписьXML.ЗаписатьТекст(Строка(Объект.НеПодтвержденоВыпискойБанка));
				//ЗаписьXML.ЗаписатьКонецЭлемента(); //НеПодтвержденоВыпискойБанка

                Если стр.Документ.РасшифровкаПлатежа.Количество() > 0 Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("РасшифровкаПлатежа");
				Для Каждого СтрокаТЧ из стр.Документ.РасшифровкаПлатежа Цикл 
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
					ЗаписьXML.ЗаписатьНачалоЭлемента("КурсВзаиморасчетов"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.КурсВзаиморасчетов),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //КурсВзаиморасчетов	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаПлатежа"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаПлатежа),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаПлатежа	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаВзаиморасчетов"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаВзаиморасчетов),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаВзаиморасчетов	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("КратностьВзаиморасчетов"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.КратностьВзаиморасчетов),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //КурсВзаиморасчетов	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтавкаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(СтрокаТЧ.СтавкаНДС),",","."));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтавкаНДС	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаНДС),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаНДС	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтатьяДвиженияДенежныхСредств"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СтатьяДвиженияДенежныхСредств));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтатьяДвиженияДенежныхСредств	
					
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовСКонтрагентом"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СчетУчетаРасчетовСКонтрагентом));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовСКонтрагентом	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовПоАвансам"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СчетУчетаРасчетовПоАвансам));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовПоАвансам	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт1"); 
					ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт1));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт1	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт2"); 
					ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт2));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт2	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоКт3"); 
					ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоКт3));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоКт3
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ПодразделениеКт"); 
					ЗаписьXML.ЗаписатьТекст(Строка(Объект.ПодразделениеКт));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //ПодразделениеКт
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СпособПогашенияЗадолженности"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СпособПогашенияЗадолженности));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СпособПогашенияЗадолженности	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); //РасшифровкаПлатежа	
				КонецЕсли;
				Если стр.Документ.РеквизитыКонтрагента.Количество() > 0 Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("РеквизитыКонтрагента");
				Для Каждого СтрокаТЧ из стр.Документ.РеквизитыКонтрагента Цикл 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизит"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Реквизит));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Реквизит	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Значение"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Значение));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Значение	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Представление"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Представление));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Представление	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТипКонтрагента"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.ТипКонтрагента));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //ТипКонтрагента	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); //РеквизитыКонтрагента	
                КонецЕсли;
			ИначеЕсли Строка(ТипЗнч(Объект.Ссылка)) =  "Списание с расчетного счета" Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("СписаниеСРасчетногоСчета");  
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетКонтрагента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетКонтрагента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетКонтрагента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("НомерВходящегоДокумента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НомерВходящегоДокумента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НомерВходящегоДокумента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаВходящегоДокумента");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДатаВходящегоДокумента));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НомерВходящегоДокумента
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("НазначениеПлатежа");  
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НазначениеПлатежа));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НазначениеПлатежа
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаДокумента"); 
				ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(Объект.СуммаДокумента),",","."),Символы.НПП,""));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаДокумента	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ВидОперации"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ВидОперации));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ВидОперации	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатьяДвиженияДенежныхСредств"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СтатьяДвиженияДенежныхСредств));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СтатьяДвиженияДенежныхСредств	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовСКонтрагентом"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетУчетаРасчетовСКонтрагентом));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовСКонтрагентом	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоДт1"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоДт1));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоДт1	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоДт2"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоДт2));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоДт2	
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СубконтоДт3"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СубконтоДт3));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СубконтоДт3
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ФизЛицо"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ФизЛицо));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ФизЛицо
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДоговорЗайма"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ДоговорЗайма));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ДоговорЗайма
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СчетБанк"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.СчетБанк));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетБанк

				ЗаписьXML.ЗаписатьНачалоЭлемента("ПодразделениеДт"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.ПодразделениеДт));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ПодразделениеДт

				ЗаписьXML.ЗаписатьНачалоЭлемента("НеПодтвержденоВыпискойБанка"); 
				ЗаписьXML.ЗаписатьТекст(Строка(Объект.НеПодтвержденоВыпискойБанка));
				ЗаписьXML.ЗаписатьКонецЭлемента(); //НеПодтвержденоВыпискойБанка

                Если стр.Документ.РасшифровкаПлатежа.Количество() > 0 Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("РасшифровкаПлатежа");
				Для Каждого СтрокаТЧ из стр.Документ.РасшифровкаПлатежа Цикл 
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 
					ЗаписьXML.ЗаписатьНачалоЭлемента("КурсВзаиморасчетов"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.КурсВзаиморасчетов),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //КурсВзаиморасчетов	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаВзаиморасчетов"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаВзаиморасчетов),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаВзаиморасчетов	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаПлатежа"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаПлатежа),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаПлатежа	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтавкаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(СтрокаТЧ.СтавкаНДС),",","."));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтавкаНДС	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаНДС),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаНДС	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтатьяДвиженияДенежныхСредств"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СтатьяДвиженияДенежныхСредств));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтатьяДвиженияДенежныхСредств	
					
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовСКонтрагентом"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СчетУчетаРасчетовСКонтрагентом));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовСКонтрагентом	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СчетУчетаРасчетовПоАвансам"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СчетУчетаРасчетовПоАвансам));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СчетУчетаРасчетовПоАвансам	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СпособПогашенияЗадолженности"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СпособПогашенияЗадолженности));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СпособПогашенияЗадолженности	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); //РасшифровкаПлатежа	
			КонецЕсли;
			Если стр.Документ.РеквизитыКонтрагента.Количество() > 0 Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("РеквизитыКонтрагента");
				Для Каждого СтрокаТЧ из стр.Документ.РеквизитыКонтрагента Цикл 
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТЧ"); 

					ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизит"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Реквизит));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Реквизит	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Значение"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Значение));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Значение	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Представление"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Представление));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Представление	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТипКонтрагента"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.ТипКонтрагента));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //ТипКонтрагента	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); //РеквизитыКонтрагента	
			КонецЕсли;
			Если стр.Документ.ПеречислениеЗаработнойПлаты.Количество() > 0 Тогда 
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТабЧасть");  
				ЗаписьXML.ЗаписатьТекст("ПеречислениеЗаработнойПлаты");
				Для Каждого СтрокаТЧ из стр.Документ.РеквизитыКонтрагента Цикл 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Ведомость"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Ведомость));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Реквизит	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаПлатежа"); 
					ЗаписьXML.ЗаписатьТекст(СтрЗаменить(СтрЗаменить(Строка(СтрокаТЧ.СуммаПлатежа),",","."),Символы.НПП,""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СуммаПлатежа	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("Физлицо"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.Физлицо));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //Физлицо	
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("СтатьяДвиженияДенежныхСредств"); 
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТЧ.СтатьяДвиженияДенежныхСредств));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтатьяДвиженияДенежныхСредств	
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаТЧ		
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); //ПеречислениеЗаработнойПлаты	
				КонецЕсли;
			КонецЕсли;		
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Организация");  
			ЗаписьXML.ЗаписатьТекст(Организация.Наименование);
			ЗаписьXML.ЗаписатьКонецЭлемента(); //Организация
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");  
			ЗаписьXML.ЗаписатьТекст(Строка(Объект.Дата));
			ЗаписьXML.ЗаписатьКонецЭлемента(); //Дата
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");  
			ЗаписьXML.ЗаписатьТекст(Строка(Объект.Номер));
			ЗаписьXML.ЗаписатьКонецЭлемента(); //Дата
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент");  
			ЗаписьXML.ЗаписатьТекст(Объект.Контрагент.Наименование);
			ЗаписьXML.ЗаписатьКонецЭлемента(); //Контрагент
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //Документ              
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Root  	
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

Процедура КоманднаяПанель1ДействиеВыбратьВидыСправочников(Кнопка)
	Для Каждого стр из ТабличнаяЧасть1 Цикл 
		стр.Выгружать = Истина;	
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанель1ДействиеОтменитьВыборСправочников(Кнопка)
	Для Каждого стр из ТабличнаяЧасть1 Цикл 
		стр.Выгружать = Ложь;	
	КонецЦикла;
КонецПроцедуры

Процедура ПутьНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите Каталог";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "XML (*.xml)|*.xml"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "t:\";
	Если Диалог.Выбрать() Тогда
		Элемент.значение = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

//Процедура КоманднаяПанель1УдалитьСформированные(Кнопка)
//	Для Каждого СтрТЧ Из ТабличнаяЧасть1 Цикл 
//		ТекПоступление = СтрТЧ.ПоступлениеТоваров;
//		ТекРеализация = СтрТЧ.РеализацияТоваров;
//		ТекПоступлениеПоРеализации = СтрТЧ.ПоступлениеПоРеализации;
//		
//		Если ЗначениеЗаполнено(ТекРеализация) Тогда 
//			Док = ТекРеализация.ПолучитьОбъект();
//			Док.ДокументОснование = "";
//			Док.ПометкаУдаления = Истина;
//			Док.Записать();
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ТекПоступлениеПоРеализации) Тогда 
//			Док = ТекПоступлениеПоРеализации.ПолучитьОбъект();
//			Док.ДокументОснование = "";
//			Док.ПометкаУдаления = Истина;
//			Док.Записать();
//		КонецЕсли;
//	КонецЦикла;
//	КоманднаяПанель1Заполнить("");
//КонецПроцедуры
